package javase02.t05test;

/*
Разработайте приложение, позволяющее формировать группы студентов по разным дисциплинам.
Состав групп может быть разным. Каждая дисциплина в отдельности определяет,
целыми или вещественными будут оценки или нет.

Необходимо найти группы, в которые входит студент X, и сравнить его оценки.
Для огранизации перечня дисциплин можно использовать перечисление.
 */
public class MainGroup {
    public static void main(String[] args) {
        Group group = new Group();

    }
}
